In [3]:
import pandas as pd

In [43]:
pd.array?

In [44]:
%lsmagic

Available line magics:
%alias  %alias_magic  %autoawait  %autocall  %automagic  %autosave  %bookmark  %cat  %cd  %clear  %colors  %conda  %config  %connect_info  %cp  %debug  %dhist  %dirs  %doctest_mode  %ed  %edit  %env  %gui  %hist  %history  %killbgscripts  %ldir  %less  %lf  %lk  %ll  %load  %load_ext  %loadpy  %logoff  %logon  %logstart  %logstate  %logstop  %ls  %lsmagic  %lx  %macro  %magic  %man  %matplotlib  %mkdir  %more  %mv  %notebook  %page  %pastebin  %pdb  %pdef  %pdoc  %pfile  %pinfo  %pinfo2  %pip  %popd  %pprint  %precision  %prun  %psearch  %psource  %pushd  %pwd  %pycat  %pylab  %qtconsole  %quickref  %recall  %rehashx  %reload_ext  %rep  %rerun  %reset  %reset_selective  %rm  %rmdir  %run  %save  %sc  %set_env  %store  %sx  %system  %tb  %time  %timeit  %unalias  %unload_ext  %who  %who_ls  %whos  %xdel  %xmode

Available cell magics:
%%!  %%HTML  %%SVG  %%bash  %%capture  %%debug  %%file  %%html  %%javascript  %%js  %%latex  %%markdown  %%perl  %%prun  %%pypy  %%python  %%python2  %%python3  %%ruby  %%script  %%sh  %%svg  %%sx  %%system  %%time  %%timeit  %%writefile

Automagic is ON, % prefix IS NOT needed for line magics.

In [45]:
!pwd

/home/user/iw_proj_01/pandas_numpy_tasks

In [47]:
!ls -a

.			 data		     README.md
..			 .git		     requirements.txt
assignment_numpy.ipynb	 .gitignore	     test
assignment_pandas.ipynb  .ipynb_checkpoints  test.ipynb

In [48]:
!python3 -m pip install some_py_library

ERROR: Could not find a version that satisfies the requirement some_py_library (from versions: none)
ERROR: No matching distribution found for some_py_library

In [4]:
data = pd.read_csv("./data/adult.data.csv")
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [5]:
d_copy = data.copy(deep=True)
data[:10].to_csv('saved_10.csv', index=False)

len(data) # 32561
len(data['education'].unique()) # 16

16

In [9]:
print(data.salary.unique(), data.salary.nunique())

['<=50K' '>50K'] 2

In [10]:
data.nunique()

age                  73
workclass             9
fnlwgt            21648
education            16
education-num        16
marital-status        7
occupation           15
relationship          6
race                  5
sex                   2
capital-gain        119
capital-loss         92
hours-per-week       94
native-country       42
salary                2
dtype: int64

In [11]:
data.info() # data.dtypes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education-num   32561 non-null  int64
 5   marital-status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital-gain    32561 non-null  int64
 11  capital-loss    32561 non-null  int64
 12  hours-per-week  32561 non-null  int64
 13  native-country  32561 non-null  object
 14  salary          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [12]:
data.describe()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

In [13]:
data.columns.to_list()

['age',
 'workclass',
 'fnlwgt',
 'education',
 'education-num',
 'marital-status',
 'occupation',
 'relationship',
 'race',
 'sex',
 'capital-gain',
 'capital-loss',
 'hours-per-week',
 'native-country',
 'salary']

In [14]:
data['new_col'] = True
data.head(3)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary,new_col
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K,True
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K,True
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K,True

In [15]:
data.drop(['salary', 'new_col', 'occupation'], axis=1).head(3)

,age,workclass,fnlwgt,education,education-num,marital-status,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country
0,39,State-gov,77516,Bachelors,13,Never-married,Not-in-family,White,Male,2174,0,40,United-States
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Husband,White,Male,0,0,13,United-States
2,38,Private,215646,HS-grad,9,Divorced,Not-in-family,White,Male,0,0,40,United-States

In [16]:
data[data['education'].isin(['Bachelors', '11th'])].tail(3) # data[data[‘education’] == 'Bachelors']

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary,new_col
32533,54,Private,337992,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,Asian-Pac-Islander,Male,0,0,50,Japan,>50K,True
32536,34,Private,160216,Bachelors,13,Never-married,Exec-managerial,Not-in-family,White,Female,0,0,55,United-States,>50K,True
32538,38,Private,139180,Bachelors,13,Divorced,Prof-specialty,Unmarried,Black,Female,15020,0,45,United-States,>50K,True

In [17]:
data.groupby(["education"]).agg({
    "age": "mean",
    "hours-per-week": "min",
    "occupation": "last",
    "marital-status": "count"
}).reset_index()

       education        age  hours-per-week         occupation  marital-status
0           10th  37.429796               1  Handlers-cleaners             933
1           11th  32.355745               2              Sales            1175
2           12th  32.000000               6    Protective-serv             433
3        1st-4th  46.142857               4  Machine-op-inspct             168
4        5th-6th  42.885886               3  Machine-op-inspct             333
5        7th-8th  48.445820               2       Craft-repair             646
6            9th  41.060311               1      Other-service             514
7     Assoc-acdm  37.381443               1       Tech-support            1067
8      Assoc-voc  38.553546               1              Sales            1382
9      Bachelors  38.904949               2     Prof-specialty            5355
10     Doctorate  47.702179               1                  ?             413
11       HS-grad  38.974479               1    Exec-managerial           10501
12       Masters  44.049913               1    Exec-managerial            1723
13     Preschool  42.764706              10      Other-service              51
14   Prof-school  44.746528               2     Prof-specialty             576
15  Some-college  35.756275               1    Protective-serv            7291

In [18]:
data['sex'].apply(lambda x: x.upper()).head()

0      MALE
1      MALE
2      MALE
3      MALE
4    FEMALE
Name: sex, dtype: object

In [19]:
data[['sex', 'salary']].head()

      sex salary
0    Male  <=50K
1    Male  <=50K
2    Male  <=50K
3    Male  <=50K
4  Female  <=50K

In [20]:
data.iloc[2]
data.iloc[2:5, 0:2]

   age workclass
2   38   Private
3   53   Private
4   28   Private

In [21]:
data.loc[2:4,['age','education']]

   age  education
2   38    HS-grad
3   53       11th
4   28  Bachelors

In [22]:
data.sample(3)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary,new_col
16205,36,Private,99146,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,1887,40,United-States,>50K,True
16251,55,Self-emp-not-inc,349910,Assoc-acdm,12,Married-civ-spouse,Sales,Husband,White,Male,0,0,60,United-States,<=50K,True
9489,46,Private,142719,HS-grad,9,Married-spouse-absent,Farming-fishing,Not-in-family,White,Male,0,0,65,United-States,<=50K,True

In [23]:
data.nlargest(3, 'age')

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary,new_col
222,90,Private,51744,HS-grad,9,Never-married,Other-service,Not-in-family,Black,Male,0,2206,40,United-States,<=50K,True
1040,90,Private,137018,HS-grad,9,Never-married,Other-service,Not-in-family,White,Female,0,0,40,United-States,<=50K,True
1935,90,Private,221832,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,45,United-States,<=50K,True

In [24]:
data[['education','age', 'sex']].groupby(['education', 'sex'], as_index=False).mean().head()

  education     sex        age
0      10th  Female  35.447458
1      10th    Male  38.346395
2      11th  Female  30.546296
3      11th    Male  33.407806
4      12th  Female  29.756944

In [25]:
data.sort_values(by='education').head(3)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary,new_col
5843,18,Private,50879,10th,6,Never-married,Other-service,Own-child,White,Male,0,0,6,United-States,<=50K,True
20930,18,?,184416,10th,6,Never-married,?,Own-child,Black,Male,0,0,30,United-States,<=50K,True
27263,28,Private,66434,10th,6,Never-married,Other-service,Unmarried,White,Female,0,0,15,United-States,<=50K,True

In [ ]:
# The dropna () function is used to remove a row or a column from a dataframe which has a NaN or no values in it.

In [26]:
data.query('(age > 89) and (education == "Bachelors")')[:7]

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary,new_col
1935,90,Private,221832,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,45,United-States,<=50K,True
4109,90,?,256514,Bachelors,13,Widowed,?,Other-relative,White,Female,991,0,10,United-States,<=50K,True
6232,90,Self-emp-not-inc,155981,Bachelors,13,Married-civ-spouse,Prof-specialty,Husband,White,Male,10566,0,50,United-States,<=50K,True
8973,90,Private,46786,Bachelors,13,Married-civ-spouse,Sales,Husband,White,Male,9386,0,15,United-States,>50K,True
11996,90,Private,40388,Bachelors,13,Never-married,Exec-managerial,Not-in-family,White,Male,0,0,55,United-States,<=50K,True
15892,90,Private,88991,Bachelors,13,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,England,>50K,True
18277,90,Private,311184,Bachelors,13,Married-civ-spouse,Sales,Husband,White,Male,0,0,20,?,<=50K,True

In [27]:
d1 = [[1,2,3], [4,5,6], [7,80,9]]
df1 = pd.DataFrame(d1)
df1

   0   1  2
0  1   2  3
1  4   5  6
2  7  80  9

In [28]:
df1 = pd.DataFrame(d1, index = ['a', 'b', 'c'], columns = ['X', 'Y', 'Z'])
df1

   X   Y  Z
a  1   2  3
b  4   5  6
c  7  80  9

In [29]:
df1.X # df1['X']

a    1
b    4
c    7
Name: X, dtype: int64

In [30]:
df1.Y.median() # 5
df1.Y.mean() # 29

29.0

In [32]:
d2 = {'City': ['London', 'Moscow', 'Minsk'],
     'Population': [15, 20, 2],
     'IsBig': [True, True, False]}
df2 = pd.DataFrame(d2)
print(df2.shape)
print(df2.size)
print(df2.dtypes)
print(df2.columns)

(3, 3)
9
City          object
Population     int64
IsBig           bool
dtype: object
Index(['City', 'Population', 'IsBig'], dtype='object')

In [33]:
df2.value_counts()

City    Population  IsBig
London  15          True     1
Minsk   2           False    1
Moscow  20          True     1
dtype: int64

In [35]:
df2.IsBig.value_counts()

True     2
False    1
Name: IsBig, dtype: int64

In [36]:
df2.count()

City          3
Population    3
IsBig         3
dtype: int64

In [37]:
df2.describe()

       Population
count    3.000000
mean    12.333333
std      9.291573
min      2.000000
25%      8.500000
50%     15.000000
75%     17.500000
max     20.000000

In [38]:
df2.describe(include='all')

          City  Population IsBig
count        3    3.000000     3
unique       3         NaN     2
top     London         NaN  True
freq         1         NaN     2
mean       NaN   12.333333   NaN
std        NaN    9.291573   NaN
min        NaN    2.000000   NaN
25%        NaN    8.500000   NaN
50%        NaN   15.000000   NaN
75%        NaN   17.500000   NaN
max        NaN   20.000000   NaN

In [39]:
df2.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
City,3,3,London,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Population,3.0,NaN,NaN,NaN,12.333333,9.291573,2.0,8.5,15.0,17.5,20.0
IsBig,3,2,True,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [41]:
# list of tuples
matrix = [(1,2,3,4),
          (5,6,7,8,),
          (9,10,11,12),
          (13,14,15,16)]
 
# Create a Dataframe object
df = pd.DataFrame(matrix, columns = list('abcd'))
 
# Applying a lambda function to !!!each column!!! which will add 10 to the value
new_df = df.apply(lambda x : x + 10)

new_df

    a   b   c   d
0  11  12  13  14
1  15  16  17  18
2  19  20  21  22
3  23  24  25  26

In [42]:
# Applying a lambda function to !!!each row!!! which will add 5 to the value
new_df = df.apply(lambda x: x + 5, axis = 1)
 
new_df

    a   b   c   d
0   6   7   8   9
1  10  11  12  13
2  14  15  16  17
3  18  19  20  21